app/Models/CrudModel.php

INSERT INTO `t_personas` (`nombre`, `paterno`, `materno`) VALUES ('Aide', 'mamacita', 'bizcocho')
---
        public function insertar($datos){
            $Nombres = $this->db->table('t_personas');
			$Nombres->insert($datos);

UPDATE `t_personas` SET `id_nombre` = '17', `nombre` = 'calderon', `paterno` = 'hinojosa', `materno` = 'Ramirez'
WHERE `id_nombre` = '17'
---
        public function actualizar($data,$idNombre){
            $Nombres = $this->db->table('t_personas');
            $Nombres->set($data);
            $Nombres->where('id_nombre',$idNombre);
            return $Nombres->update();